website.org
#+TITLE: Personal Website
#+DATE: July 17, 2018
#+AUTHOR: Colin McLear

*** Resources
:PROPERTIES:
:EXPORT_FILE_NAME: resources
:EXPORT_HUGO_WEIGHT: 0
:EXPORT_HUGO_MENU: :menu main
:END:

Here I collect links for research, teaching, technology, and whatever else might be useful.

**** Philosophy Links
- [[http://plato.stanford.edu][Stanford Encyclopedia of Philosophy]]
- [[http://www.iep.utm.edu/][Internet Encyclopedia of Philosophy]]
- [[http://philpapers.org][PhilPapers]]
  
**** Reading & Writing Philosophy
- [[http://www.jimpryor.net/teaching/vocab/index.html][Philosophical Terms & Methods]]
- [[http://www.jimpryor.net][Jim Pryor's]] guides to [[http://www.jimpryor.net/teaching/guidelines/reading.html][reading]] and [[http://www.jimpryor.net/teaching/guidelines/writing.html][writing]] philosophy
- [[http://philosophy.hku.hk/think/][Critical Thinking]]
- [[http://owl.english.purdue.edu/owl/][Purdue Online Writing Lab]] 
- [[http://writingproject.fas.harvard.edu/files/hwp/files/philosophical_writing.pdf][A Guide to Philosophical Writing]]
- [[https://www.dropbox.com/s/lyods0bt22x8u6l/ThesisOverview.pdf?dl=0][Writing a Thesis Statement]]
- [[https://www.dropbox.com/s/eaggc570nfu6nqa/PaperStructure.pdf?dl=0][Philosophy Paper Structure]]

**** Early Modern Resources
- [[https://projectvox.library.duke.edu][Project Vox]]
- [[http://publish.uwo.ca/~cdyck5/UWOKRG/digitalarchive.html][Digital Archive of 18th Century German Texts]] (UWO Kant Research Group)
- [[http://publish.uwo.ca/~cdyck5/UWOKRG/women.html][Women Intellectuals of 18th Century Germany]] (UWO Kant Research Group)
- [[https://historyofwomenphilosophers.org/ecc/#hwps][Encyclopedia of Concise Concepts by Women Philosophers]] (Mary Ellen Waithe & Ruth Hagengruber)
- [[http://www.unicaen.fr/puc/sources/prodescartes/accueil][Corpus Descartes]]
- [[http://digitalcavendish.org/text-archive/links-to-digital-texts/][Digital Cavendish Project]]
- [[http://www.gwlb.de/Leibniz/][Gottfried Wilhelm Leibniz Bibliothek]]
- [[http://emps.me/bryce/resources-for-philosophers/christian-wolff/][Christian Wolff]] (Bryce Gessell)
- [[http://www.kuttaka.org/~JHL/Main.html][Johann Heinrich Lambert Collected Works Online]] (Maarten Bullynck)

**** Kant Related Links
- [[http://kantpapers.org][KantPapers]]
- [[http://www.manchester.edu/kant/Home/index.htm][Kant in the Classroom]] (Steve Naragon)
- [[http://staffweb.hkbu.edu.hk/ppp/Kant.html][Kant on the Web]] (Steve Palmquist)
- [[http://publish.uwo.ca/~cdyck5/UWOKRG/kantsbooks.html][Kant's Books]] (UWO Kant Research Group)
- [[https://dspace.ut.ee/handle/10062/42108][Kants Handexemplar von Meiers Auszug aus der Vernunftlehre]] (University of Tartu)
- [[https://www.philosophie.fb05.uni-mainz.de/forschungsstellen-und-weitere-einrichtungen/fs_kant/][Kant-Forschungsstelle]]
- [[http://earlymoderntexts.com][Early Modern Philosophy Texts]]
- [[https://korpora.zim.uni-duisburg-essen.de/Kant/verzeichnisse-gesamt.html][Kant Akademieausgabe (Courtesy of Universität Duisburg-Essen)]]
- [[http://knb.mpiwg-berlin.mpg.de/kant/home][Database of Kant's concepts for a theory of nature]]

**** Sources for online German texts
- [[http://gso.gbv.de/DB=1.28/SET=1/TTL=1/][VD17]]
- [[http://www.zvdd.de/startseite/][ZVDD]]
- [[http://kvk.bibliothek.kit.edu/?digitalOnly=0&embedFulltitle=0&newTab=0][KVK]]
- [[http://digital-beta.staatsbibliothek-berlin.de][Digitalisierte Sammlungen (Berlin)]]
- [[https://www.deutsche-digitale-bibliothek.de][Deutsche Digitale Bibliothek]]

**** Academic Technology & Tools

Links to tools I use for research and writing

- [[http://daringfireball.net/projects/markdown/][Markdown]]: Plaintext markup for easy writing
- [[http://johnmacfarlane.net/pandoc/index.html][Pandoc]]: File conversion
- [[https://www.gnu.org/software/emacs/][Emacs]]: A superb (and free) text editor and writing/research platform
   - If you want to get started with emacs you might take a look at my
     [[https://github.com/mclear-tools/dotemacs][emacs configuration files]]
- [[http://bibdesk.sourceforge.net][BibDesk]]: Reference manager for bib files (Free, Mac OS only)
- [[https://www.sonnysoftware.com][Bookends]]: A fantastic general reference manager (Mac OS only)
- [[https://www.devontechnologies.com][Devonthink]]: Database & smart document manager (Mac OS only)
- [[http://skim-app.sourceforge.net][Skim]]: PDF reader & annotator (Free, Mac OS only)
- [[https://www.zotero.org][Zotero]]: A great free way to collect and manage references. Works well with bibtex via [[https://github.com/retorquere/zotero-better-bibtex][zotero better bibtex]]
- [[http://git-scm.com][Git]]: Version control
- [[https://education.github.com][Github]]: Online storage and collaboration
- Kieran Healy's [[http://kieranhealy.org/resources/][writing resources page]]
- [[http://profhacker.com][Profhacker]]: Blog on teaching & technology
- [[http://programminghistorian.org][The Programming Historian]]: Tutorials for aspiring digital humanists
