content/resources.md
+++
title = "Resources"
draft = false
toc = false
+++

Here I collect links for research, teaching, technology, and whatever else I think might be useful.


## Philosophy Links {#philosophy-links}

-   [Stanford Encyclopedia of Philosophy](http://plato.stanford.edu)
-   [Internet Encyclopedia of Philosophy](http://www.iep.utm.edu/)
-   [PhilPapers](http://philpapers.org)


## Reading &amp; Writing Philosophy {#reading-and-writing-philosophy}

-   [Philosophical Terms &amp; Methods](http://www.jimpryor.net/teaching/vocab/index.html)
-   [Jim Pryor&rsquo;s](http://www.jimpryor.net) guides to [reading](http://www.jimpryor.net/teaching/guidelines/reading.html) and [writing](http://www.jimpryor.net/teaching/guidelines/writing.html) philosophy
-   [Critical Thinking](http://philosophy.hku.hk/think/)
-   [Purdue Online Writing Lab](http://owl.english.purdue.edu/owl/)
-   [A Guide to Philosophical Writing](http://writingproject.fas.harvard.edu/files/hwp/files/philosophical_writing.pdf)
-   [Writing a Thesis Statement](https://www.dropbox.com/s/lyods0bt22x8u6l/ThesisOverview.pdf?dl=0)
-   [Philosophy Paper Structure](https://www.dropbox.com/s/eaggc570nfu6nqa/PaperStructure.pdf?dl=0)


## Early Modern Resources {#early-modern-resources}

-   [Project Vox](https://projectvox.library.duke.edu)
-   [Digital Archive of 18th Century German Texts](http://publish.uwo.ca/~cdyck5/UWOKRG/digitalarchive.html) (UWO Kant Research Group)
-   [Women Intellectuals of 18th Century Germany](http://publish.uwo.ca/~cdyck5/UWOKRG/women.html) (UWO Kant Research Group)
-   [Encyclopedia of Concise Concepts by Women Philosophers](https://historyofwomenphilosophers.org/ecc/#hwps) (Mary Ellen Waithe &amp; Ruth Hagengruber)
-   [Corpus Descartes](http://www.unicaen.fr/puc/sources/prodescartes/accueil)
-   [Digital Cavendish Project](http://digitalcavendish.org/text-archive/links-to-digital-texts/)
-   [Gottfried Wilhelm Leibniz Bibliothek](http://www.gwlb.de/Leibniz/)
-   [Christian Wolff](http://emps.me/bryce/resources-for-philosophers/christian-wolff/) (Bryce Gessell)
-   [Johann Heinrich Lambert Collected Works Online](http://www.kuttaka.org/~JHL/Main.html) (Maarten Bullynck)


## Kant Related Links {#kant-related-links}

-   [KantPapers](http://kantpapers.org)
-   [Kant in the Classroom](https://users.manchester.edu/facstaff/ssnaragon/kant/Home/index.htm) (Steve Naragon)
-   [Kant on the Web](http://staffweb.hkbu.edu.hk/ppp/Kant.html) (Steve Palmquist)
-   [Kant&rsquo;s Books](http://publish.uwo.ca/~cdyck5/UWOKRG/kantsbooks.html) (UWO Kant Research Group)
-   [Kants Handexemplar von Meiers Auszug aus der Vernunftlehre](https://dspace.ut.ee/handle/10062/42108) (University of Tartu)
-   [Kant-Forschungsstelle](https://www.philosophie.fb05.uni-mainz.de/forschungsstellen-und-weitere-einrichtungen/fs_kant/)
-   [Early Modern Philosophy Texts](http://earlymoderntexts.com)
-   [Kant Akademieausgabe (Courtesy of Universität Duisburg-Essen)](https://korpora.zim.uni-duisburg-essen.de/Kant/verzeichnisse-gesamt.html)
-   [Database of Kant&rsquo;s concepts for a theory of nature](http://knb.mpiwg-berlin.mpg.de/kant/home)


## Sources for online German texts {#sources-for-online-german-texts}

-   [VD17](http://gso.gbv.de/DB=1.28/SET=1/TTL=1/)
-   [ZVDD](http://www.zvdd.de/startseite/)
-   [KVK](http://kvk.bibliothek.kit.edu/?digitalOnly=0&embedFulltitle=0&newTab=0)
-   [Digitalisierte Sammlungen (Berlin)](http://digital-beta.staatsbibliothek-berlin.de)
-   [Deutsche Digitale Bibliothek](https://www.deutsche-digitale-bibliothek.de)


## Academic Technology &amp; Tools {#academic-technology-and-tools}

Links to tools I use for research and writing

-   [Markdown](http://daringfireball.net/projects/markdown/): Plaintext markup for easy writing
-   [Pandoc](http://johnmacfarlane.net/pandoc/index.html): File conversion
-   [Emacs](https://www.gnu.org/software/emacs/): A superb (and free) text editor and writing/research platform
    -   If you want to get started with emacs you might take a look at my
        [emacs configuration files](https://github.com/mclear-tools/dotemacs)
-   [BibDesk](http://bibdesk.sourceforge.net): Reference manager for bib files (Free, Mac OS only)
-   [Bookends](https://www.sonnysoftware.com): A fantastic general reference manager (Mac OS only)
-   [Devonthink](https://www.devontechnologies.com): Database &amp; smart document manager (Mac OS only)
-   [Skim](http://skim-app.sourceforge.net): PDF reader &amp; annotator (Free, Mac OS only)
-   [Zotero](https://www.zotero.org): A great free way to collect and manage references. Works well with bibtex via [zotero better bibtex](https://github.com/retorquere/zotero-better-bibtex)
-   [Git](http://git-scm.com): Version control
-   [Github](https://education.github.com): Online storage and collaboration
-   Kieran Healy&rsquo;s [writing resources page](http://kieranhealy.org/resources/)
-   [Profhacker](http://profhacker.com): Blog on teaching &amp; technology
-   [The Programming Historian](http://programminghistorian.org): Tutorials for aspiring digital humanists
